{
	"categories": [
		{
			"path": "interactive",
			"pieces": [
				{
					"sortOrder": "10",
					"published": "true",
					"title": "3DJ",
					"description": "A virtual reality real-time audio manipulation tool",
					"featuredImage": "/img/featured-images/3DJ.jpg",
					"rawHTML": "<h2>Introduction</h2><p>With an increasingly complex industry revolving around audio mixing and editing, the need for useful interactions that accomplish these tasks in a 3D virtual space continues to grow. Our project explores methods for sound and music interaction. This involves the development of different ways of visualizing the audio as well as seeing which actions feel most natural to users in this 3D space. While work has been done on sound interfaces, much of the work stays in the 2D space for digital audio workstations. However, there are several tools that exist for users to work with instruments in a VR space. Our project develops a tool set that allows users to manipulate and create audio in a 3D setting, combining some of the work done for digital audio workstations in 2D with the richness of a 3D space seen in VR. The metaphor we explore is a DJ-style workstation, such that the user can observe and interact with several different tools that change the sound being played in real time.</p> <p>We built this project for exploring novel methods of sound and music interaction in 3D space. We have built a DJ-style workstation to provide the user a meaningful context for their actions, different functions for manipulation, and a designated space to interact. Immersive musical instruments give users a high degree of control with gestural interaction to perform, compose, or improvise music in real time. [9] We have also enabled ways to select and manipulate specific audio attributes such as level adjustments, effect filters, changing playback rate, and playback control. These basic uses have application in a wide variety of tools from simple audio editing to live music creation. Metaphors are commonly used in UI as powerful tools to enable quick understanding and more effective usability [2], and thus we chose to simulate a virtual digital audio workstation. We have bridged the gap between the actions a user can perform and their natural human interaction. For example, using the distance between the user’s hands to adjust values creates a more natural interaction than selecting a volume modifier from a 2D menu.</p><!-- <h2>Example with live audio:</h2> <video controls poster=\"/img/featured-images/3DJ-poster-1.jpg\"><source src=\"/video/3DJ-sound.mp4\" type=\"video/mp4\">Your browser does not support the video tag.</video> <h2>Direct video capture:</h2> <video controls poster=\"/img/featured-images/3DJ-poster-2.jpg\"><source src=\"/video/3DJ-video.mp4\" type=\"video/mp4\">Your browser does not support the video tag.</video>-->",
					"pdf": "/documents/3DJ.pdf",
					"href": "/work/interactive/3DJ",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "20",
					"published": "true",
					"title": "Immersive Art",
					"description": "Step inside your masterpiece",
					"featuredImage": "/img/featured-images/immersive-art.jpg",
					"rawHTML": "<video controls poster=\"/img/featured-images/immersive-art-poster.jpg\"><source src=\"/video/immersive-art.mp4\" type=\"video/mp4\">Your browser does not support the video tag.</video>",
					"applicationLink": {
						"href": "/vr/immersive-art",
						"text": "View live application"
					},
					"href": "/work/interactive/immersive-art",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "21",
					"published": "true",
					"title": "Swarm",
					"description": "Procedural audio visualization",
					"featuredImage": "/img/featured-images/cluster.jpg",
					"href": "/interactive/cluster/",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "30",
					"published": "true",
					"title": "The Web as a Distribution Platform for Virtual Reality Systems",
					"description": "",
					"featuredImage": "/img/featured-images/webvr2.jpg",
					"rawHTML": "",
					"pdf": "/documents/Web_Virtual_Reality_Systems.pdf",
					"href": "/work/interactive/web-virtual-reality-systems",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "40",
					"published": "true",
					"title": "colorspace",
					"description": "Three-dimensional colorspace models: using geometry to calculate colors in 3D space",
					"featuredImage": "/img/featured-images/colorspace.jpg",
					"rawHTML": "<video controls poster=\"/img/featured-images/colorspace-poster.jpg\"><source src=\"/video/colorspace.mp4\" type=\"video/mp4\">Your browser does not support the video tag.</video>",
					"applicationLink": {
						"href": "/cg/colorspace/",
						"text": "View live application"
					},
					"href": "/work/interactive/colorspace",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "50",
					"published": "true",
					"title": "Algorhythm",
					"description": "Interactive beat sequencing",
					"featuredImage": "/img/featured-images/rhthym-wheel.jpg",
					"rawHTML": "<video controls poster=\"/img/featured-images/algorhythm-poster.jpg\"><source src=\"/video/algorhythm.mp4\" type=\"video/mp4\">Your browser does not support the video tag.</video>",
					"applicationLink": {
						"href": "/cg/rhythm-wheel",
						"text": "View live application"
					},
					"href": "/work/interactive/algorhythm",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "60",
					"published": "true",
					"title": "Zoom Eternal",
					"description": "Realtime physics robot battle arena game",
					"featuredImage": "/img/featured-images/zoom-eternal.jpg",
					"rawHTML": "<video controls poster=\"/img/featured-images/zoom-eternal-poster.jpg\"><source src=\"/video/zoom-eternal.mp4\" type=\"video/mp4\">Your browser does not support the video tag.</video>",
					"applicationLink": {
						"href": "/vg/team_zoom_eternal_final.7z",
						"text": "Download game"
					},
					"href": "/work/interactive/zoom-eternal",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "70",
					"published": "true",
					"title": "Logarithmic Spiral for Smooth Camera Motion",
					"description": "Dynamically generating log spirals for camera trajectory",
					"featuredImage": "/img/featured-images/log-spiral.jpg",
					"rawHTML": "<video controls poster=\"/img/featured-images/log-spiral-poster.jpg\"><source src=\"/video/log-spiral.mp4\" type=\"video/mp4\">Your browser does not support the video tag.</video>",
					"applicationLink": {
						"href": "/cg/log_spiral.7z",
						"text": "Download application"
					},
					"pdf": "/documents/Log_Spiral.pdf",
					"href": "/work/interactive/logarithmic-spiral-camera-motion",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "80",
					"published": "true",
					"title": "Painting Nature",
					"description": "A non-traditional paint program used to create striking scenes of nature",
					"featuredImage": "/img/featured-images/painting-nature.jpg",
					"rawHTML": "<p>Our challenge for this application was to create our own paint program from scratch. The catch was that we were not allowed to use any sort of traditional painting tools. Pen, brush, line, box, were all out of the question. I decided to create a program in which the user can draw different nature scenes. His tools are elements of Mother Nature. His palette is the seasons.</p><img alt=\"Painting Nature\" src=\"/img/interactive/painting-nature-1.jpg\" /><img alt=\"Painting Nature\" src=\"/img/interactive/painting-nature-2.jpg\" />",
					"href": "/work/interactive/painting-nature",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "90",
					"published": "true",
					"title": "3D Animation Editor",
					"description": "",
					"featuredImage": "/img/featured-images/3d-animation-editor.jpg",
					"href": "/work/interactive/code/3d-animation-editor",
					"openInNewTab": "false",
					"codeBlocks": [
						{
							"pretext": "<img src=\"/img/interactive/3d-animation-editor.png\" alt=\"3D Animation Editor\" /><p>When the program is initially loaded, the user is asked to define a figure. This figure is defined by how the user constructs the skeleton and will remain constant throughout the animation. Once the skeleton has been constructed, the user can continue to the animation editor and move the skeleton in eight different keyframes to animate it.</p><p>Upon moving to the animation editor, the program stores the positions of the joints in the skeleton in an array and sets every keyframe to this shape. The user can change each different keyframe by dragging the different joints of the skeleton with the mouse and watch the figure animate, at which point the animation will loop through the eight different keyframes he has defined. Since the locations of each skeleton are stored in an array for each keyframe, the user can switch between keyframes and the appropriate skeletons will be saved and loaded into and from their arrays.</p><p>In order to smooth the animation, four-point subdivision is used along each joint in the skeleton over the eight keyframes. For example, if the skeleton has four different joints, then the first joint in each keyframe forms a curve, the second joint in each keyframe forms another curve, and so on, for however many joints the skeleton has. So a figure with four different control points forms four different curves. Then, while animating, the location of the joints move successively along the points of the curve frame by frame to smoothly animate it in between keyframes.</p><p>Each skeleton (made up of sets of points) is stored into an array called keyframe1, keyframe2, ..., to keyframe8, for the eight different figures the user specifies for the eight keyframes. A two-dimensional area is set up in order to store each curve to be subdivided. The amount of joints the user attaches to the skeleton is dynamic and can change, so the array of curves must be dynamic. Then a loop is created to cycle through the array of skeletons at each keyframe to put each point of each curve into its own array:</p>",
							"src": "/code/interactive/cg/3d-animation-editor-1.java"
						},
						{
							"pretext": "<p>Once each curve is separated into its own array, it can be passed into the subdivide function which will subdivide each curve using four-point subdivision. Four-point subdivision is implemented using refine, tuck, and untuck, passing in a scaler of 1 for tuck and -1 for untuck. The algorithm is as follows:</p>",
							"src": "/code/interactive/cg/3d-animation-editor-2.java",
							"posttext": "<p><u>Other features of the application:</u></p><p><i>Two-dimensional editing mode:</i><br> The user can choose a specific link in the larger 3D model and switch to the 2D editor to edit that link. Upon entering the 2D editor, the radii of the spheres in the selected link are loaded into the 2D model. The user can then change the size of the two spheres in the link which will change the corresponding spheres in the 3D model. The distance between spheres is fixed in the 2D editor since the distance between joints cannot be changed in the 3D model.</p><a class=\"callout\" href=\"/computer-graphics/P4B/source.zip\">Download application</a>"
						}
					]
				},
				{
					"sortOrder": "100",
					"published": "true",
					"title": "Projectile Prediction",
					"description": "",
					"featuredImage": "/img/featured-images/projectile-prediction.jpg",
					"href": "/computer-graphics/P2/",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "110",
					"published": "true",
					"title": "Polygon Smoothing",
					"description": "",
					"featuredImage": "/img/featured-images/polygon-subdivision.jpg",
					"href": "/work/interactive/code/polygon-subdivision",
					"openInNewTab": "false",
					"codeBlocks": [
						{
							"pretext": "<img class=\"limit-width-500 center\" src=\"/img/featured-images/polygon-subdivision.jpg\" alt=\"polygon subdivision\" /><h3>Directions</h3><p>Drag vertices to form a polygon. Press 1, 2, 3, 4, or 5 to perform that many iterations (r) of subdivide. The red curve is s=0; the blue curve is s=.5; the green curve is s=1.</p><h3>Problem</h3><p>There are many reasons to take a polygon and smooth it's edges to remove the edges and create a continuous curve. Take a given polygon and create your own subdivide method that smooths the polygon. Pass in variables r and s. Variable r will be the number of iterations your subdivision method performs and variable s will be the distance that the subdivision untucks to compensate for shrinkage.</p><h3>Solution</h3><p>For my subdivide method, I first refined the original polygon by calculating the midpoints between every original vertex. Then I calculated the cubic B-spline by average each point in the polygon with the two points adjacent to it. By nesting the average, I could simplify the solution into a single algebraic equation:</p><p>A(A(A(pt i-1, pt i), pt i ),A(pt i,A(pt i,pt i+1) ) ); </p><p>where i is the vertex moving inward, (i-1) is the point to the left, and (i+1) is the point to the right. Since the average of two points is (A+B)/2, substitute this into the complex nest of averages and algebraically simplify to:</p><p>(1/8)(i-1) + (3/4)(i) + (1/8)(i-1)</p><p>To subdivide, this is calculated for every point in the polygon. Then to compensate for shrinkage, the curve is expanded outward, in the direction normal to the curve at every point in the polygon.</p>",
							"src": "/code/interactive/cg/polygon-subdivision.java"
						}
					]
				},
				{
					"sortOrder": "120",
					"published": "false",
					"title": "Rotation Transformations, Realistic Center of Gravity",
					"description": "",
					"featuredImage": "/img/featured-images/rainbow-road.jpg",
					"href": "/work/interactive/rainbow-road",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "130",
					"published": "true",
					"title": "Medial Axis",
					"description": "",
					"featuredImage": "/img/featured-images/medial-axis.jpg",
					"href": "/work/interactive/code/medial-axis",
					"openInNewTab": "false",
					"codeBlocks": [
						{
							"pretext": "<img class=\"limit-width-800 center\" src=\"/img/interactive/medial-axis.svgz\" alt=\"Medial axis\" /> <img class=\"center vertical-space\" src=\"/img/featured-images/medial-axis.jpg\" alt=\"Medial axis\" />",
							"src": "/code/interactive/cg/medial-axis.java"
						}
					]
				},
				{
					"sortOrder": "140",
					"published": "true",
					"title": "Fermat Point",
					"description": "",
					"featuredImage": "/img/featured-images/fermat.jpg",
					"href": "/work/interactive/code/fermat-point",
					"openInNewTab": "false",
					"codeBlocks": [
						{
							"pretext": "<img class=\"full-width\" src=\"/img/interactive/fermat-point-diagram.svg\" alt=\"Fermat point\" /><h2>Problem</h2> <p>Three points can be placed anywhere in space. Find the path of least distance that connects all three points. The program must be dynamic and controlled by the user.</p><h2>Solution</h2><ol><li>Determine whether the triangle has any angle greater than (or equal to) 120 degrees. If so, then the Fermat Point is the vertex of the angle that is greater than 120 degrees.</li><li>If no angles are greater than 120 degrees, then form three equilateral triangles created by each edge of the original triangle created by A, B, and C.</li><li>Form lines connecting the outer vertex of each equilateral triangle to the opposite vertex of the original triangle (A, B, or C).</li><li>Where these lines intersect is the Fermat Point. The paths connecting the three points with the least amount of distance are the paths from each vertex to the Fermat Point, represented above by the lightest shade of blue.</li></ol>",
							"src": "/code/interactive/cg/fermat.java"
						}
					]
				}
			]
		},
		{
			"path": "web-application-development",
			"pieces": [
				{
					"sortOrder": "1",
					"published": "true",
					"title": "Dollywood",
					"description": "New site build of large scale e-commerce and marketing site for Herschend Family Entertainment. Site includes multiple theme park properties designed to use the same platform and code base.",
					"natureOfContributions": "Designed and built initial front-end site; designed the site architecture to support many sites being built on the same platform while maintaining unique branding needs for each independent site; built interactive and animated components; maintained automated build taskrunners; worked directly with client representative to ensure their needs and satisfaction were met; collaborated with UX and design team mates to improve site usability and overall quality; worked with team in India to integrate front-end build into Sitecore CMS.",
					"featuredImage": "/img/featured-images/dollywood.jpg",
					"href": "https://www.dollywood.com",
					"openInNewTab": "true"
				},
				{
					"sortOrder": "2",
					"published": "true",
					"title": "FultonCountyGA.gov",
					"description": "New public-facing web site build for the Fulton Country local government body.",
					"natureOfContributions": "Responsible for front-end build from static designs into well-structured, maintainable, and functional site; worked with back-end devs to integrate front-end build into the Sitecore CMS; led junior developers in building new front-end components and assisted with their back-end and CMS related questions while removing technical roadblocks.",
					"featuredImage": "/img/featured-images/fulton-thumb.jpg",
					"href": "https://fultoncountyga.gov/",
					"openInNewTab": "true"
				},
				{
					"sortOrder": "3",
					"published": "false",
					"title": "Hammerhead Silver",
					"description": "E-commerce site build for handmade jewelry brand, Hammerhead Silver.",
					"natureOfContributions": "Freelance; worked directly with business owners to gather requirements and add features based on their feedback.",
					"featuredImage": "/img/featured-images/bling-shark-color.jpg",
					"href": "https://hammerheadsilver.com/",
					"openInNewTab": "true"
				},
				{
					"sortOrder": "4",
					"published": "true",
					"title": "Growasis",
					"description": "Location-based web application concept built for sharing garden harvests, seed sharing, and farmers markets to help improve proximity-based food distribution.",
					"natureOfContributions": "Original idea, requirements gathering, planning, and execution.",
					"featuredImage": "/img/featured-images/growasis.jpg",
					"rawHTML": "<p>During the last hundred years, improvements in mechanical technologies have led to innovations that greatly influenced agriculture—new tools and techniques improved productivity, precision, and land coverage. These advances in technology led to prosperous agricultural economies all over the world; however, food distribution remains a problem today. Foods lose freshness as they are shipped far distances resulting in lower quality goods. Consumers have difficulty connecting to fresh markets and produce grown in their area. Urban environments deal with geographic areas where low-income residents do not have access to fresh food at all. Our project seeks to use Internet technologies to explore methods for increasing connectivity and decreasing strain in these problem areas by finding new methods to connect food producers with consumers.</p>",
					"pdf": "/documents/Growasis.pdf",
					"href": "/work/web-application-development/detail/growasis",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "5",
					"published": "true",
					"title": "Rightpoint.com",
					"description": "Added multiple features and pages to Rightpoint agency web site including news filtering pages, portfolio piece filtering pages, careers landing page, animations, and others",
					"natureOfContributions": "Iterated with designers to improve existing pages and collaborated with marketing team to add new features.",
					"featuredImage": "/img/featured-images/rightpoint.jpg",
					"href": "https://www.rightpoint.com/",
					"openInNewTab": "true"
				},
				{
					"sortOrder": "6",
					"published": "true",
					"title": "ICF International ",
					"description": "New site build for international consulting company.",
					"natureOfContributions": "Built various custom UI's including menus, search interface, and various interactive components; wrote back-end code to integrate into Sitecore CMS.",
					"featuredImage": "/img/featured-images/ICF-screenshot.jpg",
					"href": "https://www.icf.com/",
					"openInNewTab": "true"
				},
				{
					"sortOrder": "7",
					"published": "true",
					"title": "Pariveda Solutions",
					"description": "New site build for software company.",
					"natureOfContributions": "Designed and built front-end code from static designs: layout, CSS and JS structure, custom UI, & animations; collaborated with back-end devs to integrate full front-end build into Sitecore CMS.",
					"featuredImage": "/img/featured-images/pariveda-thumb-1.jpg",
					"href": "https://parivedasolutions.com/",
					"openInNewTab": "true"
				},
				{
					"sortOrder": "8",
					"published": "true",
					"title": "Brother USA",
					"description": "Public facing site build for printer and sewing machine manufacturer.",
					"natureOfContributions": "Worked in a large team to fix bugs, organize layouts, and coordinate front-end work between team members.",
					"featuredImage": "/img/featured-images/brother.jpg",
					"href": "https://www.brother-usa.com/",
					"openInNewTab": "true"
				},
				{
					"sortOrder": "9",
					"published": "true",
					"title": "Hilton Grand Vacations",
					"description": "This project involved building an internal intranet site for Hilton Grand Vacations using Microsoft SharePoint. The site has a user base of 8000 users and is used to distribute information to employees, provide links and bookmarks to benefits, communicate news & company announcements, and allow Hilton to set up pages for its internal departments. Since the site is not publicly available, I have documented small pieces of the work here on my own site.",
					"natureOfContributions": "Built custom designs into functional intranet site while working within the constraints of SharePoint platform.",
					"featuredImage": "/img/featured-images/HGV-thumb.jpg",
					"rawHTML": "<h4>Home</h4><p>Used to communicate news and announcements to employees, allow employees to connect and interact with social platforms, get an overview of latest events within the company, give employees a place to important links such as benefits, and connect employees to their respective department pages.</p><img class=\"frame\" src=\"/img/web/HGV-home.jpg\" alt=\"HGV-home\" /><h4>Topic Landing</h4><p>Used as a location for each department to have their own page with relevant information and provide a site contact for those who have further questions.</p><img class=\"frame\" src=\"/img/web/HGV-topic.jpg\" alt=\"HGV-topic\" />",
					"href": "/work/web-application-development/detail/hilton-grand-vacations",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "10",
					"published": "true",
					"title": "Atrium Health",
					"description": "Re-platform of previous site and ongoing maintenance.",
					"natureOfContributions": "Re-platformed original site from previous system into Sitecore CMS; maintained and improved site over the course of 4 years; added pages, features, and single page applications such as doctor search and urgent care locator.",
					"featuredImage": "/img/featured-images/atrium.jpg",
					"href": "https://atriumhealth.org/",
					"openInNewTab": "true"
				},
				{
					"sortOrder": "11",
					"published": "true",
					"title": "Broward Health",
					"description": "Broward Health is a hospital system in Fort Lauderdale, Florida. I am proud of this project as it was a big success since our 3-person team delivered a quality product on time and under-budget. I also learned a ton over the 3-month project dealing with frontend JavaScript architecture, writing modular and maintainable web components, and writing backend code in C# to create enterprise web apps.",
					"natureOfContributions": "Worked in small team to build out new site.",
					"featuredImage": "/img/featured-images/broward-thumb-new.jpg",
					"href": "https://www.browardhealth.org/",
					"openInNewTab": "true"
				},
				{
					"sortOrder": "12",
					"published": "true",
					"title": "Heartland Payments Systems",
					"description": "New multi-site integration build for financial tech company.",
					"natureOfContributions": "Designed front-end structure that would allow for multiple sites to be built upon the same design system and code base, while using their own custom branding for each site brand; worked with India team to integrate and debug Sitecore components.",
					"featuredImage": "/img/featured-images/heartland.jpg",
					"href": "https://www.heartlandpaymentsystems.com/",
					"openInNewTab": "true"
				},
				{
					"sortOrder": "13",
					"published": "true",
					"title": "Bay Area Air Quality Management District",
					"description": "Maintenance on existing site for air quality regulating body of San Francisco Bay area.",
					"natureOfContributions": "Minor maintenance and integration of complex data table structures.",
					"featuredImage": "/img/featured-images/baaqmd-thumb.jpg",
					"href": "http://www.baaqmd.gov/",
					"openInNewTab": "true"
				},
				{
					"sortOrder": "14",
					"published": "true",
					"title": "El Jimador",
					"year": "2013",
					"description": "The redesign of El Jimador's web site was taken on by Engauge in early 2013. Early responsive and multilingual site.",
					"natureOfContributions": "An external contractor dropped the job and disappeared, so I picked up the project and completed it to see it to production launch.",
					"featuredImage": "/img/featured-images/el-jimador-thumb.jpg",
					"href": "https://www.eljimador.com/",
					"openInNewTab": "true"
				},
				{
					"sortOrder": "15",
					"published": "true",
					"title": "Verizon Wireless",
					"year": "2014",
					"description": "Refactoring www.verizonwireless.com for their cell phone and wireless services sector. Building cart pages with a large team.",
					"natureOfContributions": "Created cart pages with complex table structures for online phone store.",
					"featuredImage": "/img/featured-images/verizon-thumb.jpg",
					"href": "https://www.verizonwireless.com/",
					"openInNewTab": "true"
				},
				{
					"sortOrder": "16",
					"published": "true",
					"title": "Food Lion",
					"year": "2014",
					"description": "Food Lion's site is a large-scale, corporate site with a robust set of features and an expansive amount of content. The site is all built on .Net and managed by a small team of people at Engauge.",
					"natureOfContributions": "Maintenance—promotions, new features, bug fixes, interactive front-end work, content updates, and deployment.",
					"featuredImage": "/img/featured-images/food-lion-thumb.jpg",
					"href": "https://www.foodlion.com/",
					"openInNewTab": "true"
				},
				{
					"sortOrder": "17",
					"published": "true",
					"title": "Cisco's Mobility Your Way",
					"year": "2013",
					"description": "",
					"natureOfContributions": "",
					"featuredImage": "/img/featured-images/mobility-your-way-thumb.jpg",
					"href": "https://www.cisco.com/c/dam/assets/sol/mob/security-threats/index.html",
					"openInNewTab": "true"
				},
				{
					"sortOrder": "18",
					"published": "true",
					"title": "Callaway Gardens",
					"year": "2012",
					"description": "Callaway Garden's site, developed in Drupal in 2012.",
					"natureOfContributions": "Built site with 3-person dev team.",
					"featuredImage": "/img/featured-images/callaway-thumb.jpg",
					"href": "https://www.callawaygardens.com/",
					"openInNewTab": "true"
				}
			]
		},
		{
			"path": "data-visualization",
			"pieces": [
				{
					"sortOrder": "1",
					"published": "true",
					"title": "Whiskeys",
					"description": "",
					"featuredImage": "/img/featured-images/whiskeys-3d-thumb.jpg",
					"rawHTML": "<a href=\"/img/visualization/whiskeys.jpg\"><img src=\"/img/visualization/whiskeys.jpg\" alt=\"Whiskey price, age, and rating visualization\" /><a/>",
					"href": "/data-visualization/whiskeys/",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "2",
					"published": "true",
					"title": "Microplastics",
					"description": "",
					"featuredImage": "/img/featured-images/microplastics-thumb.jpg",
					"href": "/data-visualization/microplastics/",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "3",
					"published": "true",
					"title": "Exoplanets",
					"description": "",
					"featuredImage": "/img/featured-images/exoplanets-thumb.jpg",
					"href": "/data-visualization/exoplanets/",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "4",
					"published": "true",
					"title": "Website Popularity Through the Decade",
					"description": "",
					"featuredImage": "/img/featured-images/website-popularity-thumb.jpg",
					"href": "/data-visualization/website-popularity/",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "5",
					"published": "true",
					"title": "Homerun Leaders 1880 - 2020",
					"description": "",
					"featuredImage": "/img/featured-images/homerun-leaders-thumb.jpg",
					"href": "/data-visualization/homerun-leaders/",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "6",
					"published": "false",
					"title": "Stock Prices Trellis",
					"description": "",
					"featuredImage": "/img/featured-images/",
					"href": "",
					"openInNewTab": "false"
				}
			]
		},
		{
			"path": "video",
			"pieces": [
				{
					"sortOrder": "1",
					"published": "true",
					"title": "Mt. Hood Climb",
					"description": "Video footage from my summit of Mt. Hood, April 2019.",
					"featuredImage": "/img/featured-images/mt-hood-thumb.jpg",
					"rawHTML": "<video controls poster=\"/img/featured-images/mt-hood-poster.jpg\"><source src=\"/video/mt-hood.mp4\" type=\"video/mp4\">Your browser does not support the video tag.</video><p>Video documenting the process of my climb of Mt. Hood, the tallest mountain in Oregon. The mountain is covered in snow year-round and stands 11,250 feet above sea level.</p>",
					"href": "/work/video/mt-hood",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "2",
					"published": "true",
					"title": "Star of Wonder",
					"description": "A film project about the grandeur of the Universe and smallness of humans.",
					"featuredImage": "/img/featured-images/star-of-wonder-thumb.jpg",
					"rawHTML": "<video style=\"width: 100%;\" controls poster=\"/img/featured-images/star-of-wonder-poster.jpg\"><source src=\"/video/star-of-wonder.mp4\" type=\"video/mp4\">Your browser does not support the video tag.</video> <p>The song, called Star of Wonder by Sufjan Stevens, I thought runs deeper than only the music and could be improved by visual aid. I thought of what the song might mean, what it tries to communicate, and what that might look like on a screen. I tried to listen more closely to the music and really focus on what images the music builds in my mind. When shooting the video, I tried to elaborate on some of the themes that the music touches on such as: the smallness or insignificance of human beings, the aesthetics of lights, the stars and the moon, the busyness of our lives and how small and insignificant we are, and the overall awesomeness and grandeur of the Universe. I shot within the city and let the bigness of the city parallel and serve as a metaphor with the theme of the hugeness of the Universe.</p><p>Since I was not able to get any shots of the night sky in detail with the primitive equipment that I have, I let the city lights serve as a substitute. I made sure that the rhythm of the video matches the rhythm of the music, such as only cutting on beat with the music or the stop motion segments alongside the fleeting sounds of the flute and keyboard. Segments with quicker tempoed sounds match with quicker movements on the screen, and more peaceful music match with serene landscapes or sights of lights. I tried to focus on the framing and color of the shots in the video the most. With all of the city lights, the colors are very important. Additionally, the camera movement provided another hugely important element in the video, which offers different artistic perspectives in the way the images are presented.</p>",
					"href": "/work/video/star-of-wonder",
					"openInNewTab": "false"
				}
			]
		},
		{
			"path": "mathematics",
			"pieces": [
				{
					"sortOrder": "1",
					"published": "false",
					"title": "Markov Chains & the Google PageRank Algorithm",
					"description": "",
					"featuredImage": "/img/featured-images/markov-chains-thumb.jpg",
					"rawHTML": "<div class=\"reading\"><p>Markov Chains are directed graphs with special properties. In a Markov Chain $\\Omega$, every vertex in the graph represents a state.$$ \\Omega = (e, v) $$</p><p>The weighted, directed edges represent the probability from transitioning from one state to another. $$w(e) = edge(i, j) = \\mathbb{P}(i \\rightarrow j)$$ The weight of the edge from vertex $i$ to vertex $j$ is equal to the probability of transition from state $i$ to state $j$. We can discretize time $t = \\{0, 1, 2, ..., t_n\\}$ such that you can think of $t$ in seconds, minutes, or whichever unit.</p><p>The probability of staying at the same state is represented by a self-loop edge back onto the state itself. Since the probability of either staying at the same state or moving to a different state is 100%, all edges leaving a vertex must sum to 1. For all $v \\in \\Omega$$$\\sum_{j}P(i,j) = 1$$</p><p>The adjacency matrix for this graph is called transition matrix $P$, size $n$ x $n$, where each element $P[i, j]$ represents the probability of moving from state $i$ to $j$ in a single step. Any element $P[i, j] = 0$ if $edge(i, j) \\notin \\Omega$. We can calculate probabilities of moving from state to state in more than one time step by raising the transition matrix to powers of $P$ equal to the $t$ number of steps.$$P^{t}(i, j) = P(i \\rightarrow j)$$</p><p>Now if instead of calculating the transition matrix for a few steps in discrete time, it is possible to calculate $P^t$ as the limit of $t$ trends infinitely. $$\\lim_{t \\to \\infty} P^{t} = \\begin{bmatrix} \\pi \\\\ \\pi \\\\ \\vdots \\\\ \\pi\\end{bmatrix} $$ So every row of our transition matrix $P$ has converged to eigenvector $\\pi$. This is known as the stationary distribution.</p><p>Our defining property of the stationary distribution is $$\\pi P=\\pi$$</p><p>So what does this mean? It means that if you calculate $P^t$ for large enough $t$, regardless of which state you start within, the probability that you will be at state $j$ at time $t$ is $\\pi(j)$ for every $v \\in \\Omega$. Of course this is only helpful if the stationary distribution is unique. If it is not unique, how can we be sure that the probability of moving from state $i$ to $j$ is contained within our $\\pi$ vector if there could be more than possible solution for the distribution?</p><p>However, there are certain properties of Markov Chains that can ensure we reach a unique stationary distribution. If we can do this, then we can determine the respective probabilities of being in any state at a given time. How quickly we can calculate this distribution is known as the mxing time of the Markov Chain.</p><p>For there to be a unique stationary distribution $\\pi$, the Markov Chain must be ergodic. The conditions for ergodicity are:</p><ol><li>Irreducibility</li><li>Aperiodicity</li></ol><h3>Irreducibility</h3><p>In terms of directed graphs, irreducibility in the chain means that the chain contains only one strongly connected component or class&mdash;you can reach every state from every other state in a finite number of steps. Any absorbing states or sink components will result in the possiblity that the chain enters anabsorbing state and then never leaves. This will prevent the convergence to a stationary distribution.</p><h3>Aperiodicity</h3><p>Periodic structure in a Markov Chain will cause reoccurence to states at regular intervals. The period of the chain is determined by the greatest common divisor of each state in the chain. Period $d_i = gcd\\{t \\geq 1: P^{t}_{ii} > 0\\}$ You can also think of aperiodicity as $d_i = 1$. In other words, the probability of moving from state $i$ back to itself is greater than one&mdash;it is possible. Aperiodicity is a class property, so all states in an irreducible chain will have the same period. Why does aperiodicity matter? Because if a chain has a periodic structure, then the landing state of a chain at time $t$ will depend on the initial state of the chain.For example, a bipartite graph will have period 2 and thus where you land after a number of steps will be either even or odd only depending upon the initial state. To avoid this, we can add self-loops on every state in the chain. So for every state, add an edge back to itself with a weight of greater than 1&mdash;meaning there is some probability, no matter how small, thatin time $t+1$ the state will return to itself.</p><h2>PageRank</h2><p>In the web graph, all vertices are pages and all edges are hyperlinks. If we can form a web graph with a unique stationary distribution and run until the stationary distribution converges, then we can learn the probability of landing on any given web page. Google calls this the PageRank.</p></div>",
					"href": "/work/mathematics/code/markov-chains",
					"openInNewTab": "false"
				},
				{
					"sortOrder": "2",
					"published": "true",
					"title": "LU Decomposition",
					"description": "",
					"featuredImage": "/img/featured-images/LU.jpg",
					"href": "/work/mathematics/code/LU",
					"openInNewTab": "false",
					"codeBlocks": [
						{
							"pretext": "<p><a href=\"http://en.wikipedia.org/wiki/LU_decomposition\">LU Decomposition</a> is one of the most common methods of matrix decomposition. It results in one lower triangular matrix, L, and one upper triangular matrix, U. LU decomposition has a much simpler process than other methods of matrix decomposition, but cannot be calculated with as much accuracy as other methods, which is especially important when writing computer programs such as this one that can extend the iterations well beyond what can be done by a human.</p><p>To begin the decomposition, we first create the <a href=\"http://en.wikipedia.org/wiki/Hilbert_matrix\">Hilbert matrix</a>, which is the matrix that we will decompose in this problem, but the process can be performed with any desired matrix. The user is prompted to enter a dimension, and the program generates the Hilbert matrix (and each successive step in the process) based upon that dimension.</p>",
							"src": "/code//math/lu/lu1.java",
							"posttext": "<p>The decimal format is used to display the matrices in the terminal in a readable form, neatly organized. The next step is to calculate our vector b, given in the problem statement, which is simply a vector equal to the number of dimensions, n, with 1 in each element: {1, 1,..., 1}.</p>"
						},
						{
							"src": "/code//math/lu/lu2.java",
							"posttext": "<p>Throughout the calculation of the decomposition, we will need to use the identity matrix at various points, so we calculate it and store it into an array named I.</p>"
						},
						{
							"src": "/code//math/lu/lu3.java",
							"posttext": "<p>After creating the Hilbert matrix, identity matrix, and vector b, we can now start to calculate L and U. The matrix U consists of our original Hilbert matrix, row-reduced into an upper-triangular <a href=\"http://en.wikipedia.org/wiki/Row_echelon_form\">row echelon form</a>.</p>"
						},
						{
							"src": "/code//math/lu/lu4.java",
							"posttext": "<p>Next, we want to find the L matrix. At this point, finding L is very similar to finding U, except now we will add another for loop to the method. L starts out as the first column of our original Hilbert matrix. Next we need an identity matrix to work with, so we create it with two for loops and create a temporary matrix, tempL, and set it to the identity. Next, we use the tempL by dividing the elements in the Hilbert matrix (locally called “Matrix”) and multiply it by our variable L matrix to find the end product L matrix.</p><p>In other words, to find L, we want to find the inverse of the Hilbert matrix--what matrix when multiplied by the original matrix will equal the identity matrix. Performing the same row-reducing operations that we used to find U on the identity matrix will give us the lower triangular matrix L.</p>"
						},
						{
							"src": "/code//math/lu/lu5.java",
							"posttext": "<p>As you can see, when evaluating our error, our LU algorithm is generally accurate, maxing out at 4.108e-14 at n=19, although our error in compared to the max norm of Hx-b only stays accurate for the first 8 or 9 dimensions. To calculate X, we used the equation Lb=y to solve for y, and then used back substitution in UX=y to solve for X. Note: the larger error in maxNorm(HX-b) occurs as a result of using Python to solve for Hx-b, which can not handle such large numbers as Java can. Regardless, the overall LU decomposition was successful and accurate.</p><img class=\"margin-bottom-small\" alt=\"LU decomposition error\" src=\"/img/math/LUchart.png\" />"
						},
						{
							"pretext": "<p>And when all put together:</p>",
							"src": "/code//math/lu/lu6.java"
						}
					]
				},
				{
					"sortOrder": "3",
					"published": "true",
					"title": "QR Decomposition via Householder Reflections",
					"description": "",
					"featuredImage": "/img/featured-images/householder.jpg",
					"href": "/work/mathematics/code/householders",
					"openInNewTab": "false",
					"codeBlocks": [
						{
							"pretext": "<p>The first step in calculating our <a title=\"Householder transformation\" href=\"http://en.wikipedia.org/wiki/Householder_transformation\">Householder reflection</a> matrices is to find our a<sub>n</sub> (also notated a<sub>i</sub>) vector, which is calculated by vector X - ||c-e1||: the vector X is the first column of the Hilbert matrix, and c is the norm of vector X. We use the same method in calculating the Hilbert matrix and the vector b as used prior in LU decomposition.</p>",
							"src": "/code/math/householders/householders1.java"
						},
						{
							"pretext": "<p>The next step is to find H(a<sub>1</sub>) which is found with the equation:</p> <p>$$H(a) =  I - \\frac{2uu^{t}}{||u||^{2}}$$</p>",
							"src": "/code/math/householders/householders2.java",
							"posttext": "<p>This will not only find H(a<sub>1</sub>), but also each subsequent H(a<sub>n</sub>) within the for loop, until we reach H(a<sub>n-1</sub>). After finding H(a<sub>n</sub>), we find H<sub>n</sub> but multiplying H<sub>n</sub> times A<sub>n-1</sub> which the first time through the loop is the Hilbert matrix.</p>"
						},
						{
							"src": "/code/math/householders/householders3.java",
							"posttext": "<p>After going through the loop, the program will find H<sub>n</sub>, set our starting matrix, HCopy, to that H<sub>n</sub>, and then perform the loop over again, until we have found Q and R. At the end of each loop H<sub>n-1</sub> is multiplied by H<sub>n</sub> and stored into Q. And next, we found the max norm of QR-H:</p>"
						},
						{
							"src": "/code/math/householders/householders4.java",
							"posttext": "<p>which uses the method we created for finding the max norm of a matrix:</p>"
						},
						{
							"src": "/code/math/matrix-operations/infinite-norm.java",
							"posttext": "<a href=\"/img/math/householder-error1.jpg\"><img alt=\"householder-error\" src=\"/img/math/householder-error1.jpg\" /></a><p>As you can see, when evaluating our error, our Householder algorithm is generally very accurate, maxing out at 3.379e-15 at n=19, although our error in compared to the max norm of Hx-b only stays accurate for the first 8 or 9 dimensions. To calculate X, we used the equation Q<sup>t</sup>b=y to solve for y, and then used back substitution in RX=y to solve for X. The larger error in maxNorm(HX-b) is because we used Python to solve for Hx-b which can not handle such large numbers as Java can. Regardless, our QR Householder factorization was successful and accurate.</p>"
						},
						{
							"pretext": "<p>And the entire piece, unbroken:</p>",
							"src": "/code/math/householders/householders5.java"
						},
						{
							"pretext": "<p>will output the following:</p>",
							"src": "/code/math/householders/householders-output.java"
						}
					]
				},
				{
					"sortOrder": "4",
					"published": "true",
					"title": "QR Decomposition via Givens Rotations",
					"description": "",
					"featuredImage": "/img/featured-images/givens.jpg",
					"href": "/work/mathematics/code/givens",
					"openInNewTab": "false",
					"codeBlocks": [
						{
							"pretext": "<p>Simply put, <a title=\"Givens rotations\" href=\"http://en.wikipedia.org/wiki/Givens_rotation\">Givens rotations</a> is a method of <a href=\"http://en.wikipedia.org/wiki/Matrix_decomposition\">matrix decomposition</a>. Just as with polynomials in Algebra, a matrix can be factored into two separate matrices and used to solve a system of equations. There are many different methods of matrix decomposition, using Given rotations being one of them.</p><p>The following code will decompose the <a href=\"http://en.wikipedia.org/wiki/Hilbert_matrix\">Hilbert matrix </a>of any dimension with very high accuracy.</p><p>To start out, we calculate the Hilbert matrix as explained in the previous problems. Again we created the identity matrix, and set both our Q and G<sub>n</sub> to the identity to begin with.</p>",
							"src": "/code/math/givens/givens1.java"
						},
						{
							"pretext": "<p>Our first step is to calculate our rotation matrices to be used in multiplying and finding each G<sub>n</sub>. The cosine and sine squares move up and left in the matrix as we cancel out each element in the column. So for example, when we try to cancel out the bottom left element of the Hilbert matrix will start in the bottom right corner and as we move upward through the Hilbert matrix columns, the cosine and sine square in the rotation matrix will move up one row and left one column as we proceed. The rest of the elements are filled with the identity. It follows the form:</p><img class=\"add-border center margin-bottom-small\" alt=\"rotation-matrix\" src=\"/img/math//rotation-matrix.jpg\" /><p>The values of cosine and sine are calculated with:</p><img class=\"add-border center margin-bottom-small\" alt=\"sin-cos\" src=\"/img/math//sin-cos.jpg\" /><p>where b is the element in the Hilbert matrix that we are trying to cancel out, and a is the element above it. So to do this, I first calculated a and b:</p>",
							"src": "/code/math/givens/givens2.java"
						},
						{
							"pretext": "<p>The i for loop begins the process and goes through the rows of the Hilbert matrix while the j loop goes through the columns, moving from bottom to top. The first time through the loop, A<sub>n</sub> equals our Hilbert matrix, the next time through, it will equal G<sub>1</sub>*Hilbert, or A<sub>1</sub>, and so forth. Now that we have found the values for our sinX and cosX variables, we will put them into their corrosponding places into the G<sub>n</sub> matrix.</p>",
							"src": "/code/math/givens/givens3.java"
						},
						{
							"pretext": "<p>Next, we multiply G<sub>n</sub> with A<sub>n</sub> to find our A<sub>n+1</sub> and print our each matrix to make sure it is being calculated correctly. Then we multiply G<sub>n</sub>*Q. At the end of the process, this will represent Q = G<sub>n</sub>…G<sub>3</sub>G<sub>2</sub>G<sub>1</sub>.</p>",
							"src": "/code/math/givens/givens4.java"
						},
						{
							"pretext": "<p>After doing this, we turn G<sub>n</sub> back into the identity and loop back through the process. Since A<sub>n</sub> has changed, it will redo the process with the new A<sub>n </sub>each time through the i loop.</p>",
							"src": "/code/math/givens/givens5.java"
						},
						{
							"pretext": "<p>Now the only step left is to calculate the max norm of the error. The same method is used as in the previous problem.</p><p>Givens error:</p><a href=\"/img/math//givens-error.jpg\"><img class=\"add-border center margin-bottom-small\" alt=\"givens-error\" src=\"/img/math//givens-error.jpg\" /></a><p>As you can see, when evaluating our error, our Givens algorithm is generally very accurate, maxing out at 1.4641e-15 at n=17, although our error in compared to the max norm of Hx-b only stays accurate for the first 8 or 9 dimensions. To calculate X, we used the equation Q<sup>t</sup>b=y to solve for y, and then used back substitution in RX=y to solve for X. The larger error in maxNorm(HX-b) is because we used Python to solve for Hx-b which can not handle such large numbers as Java can. Regardless, our QR Givens rotation factorization was successful and accurate. The Givens method is overall much more stable than the other 2 methods, LU and Householders.</p><p>The code in its entirety:</p>",
							"src": "/code/math/givens/givens-whole.java"
						},
						{
							"pretext": "<p>And its output:</p>",
							"src": "/code/math/givens/givens-output.java"
						}
					]
				},
				{
					"sortOrder": "5",
					"published": "true",
					"title": "Matrix Operations",
					"description": "",
					"featuredImage": "/img/featured-images/matrix-operations.jpg",
					"href": "/work/mathematics/code/matrix-operations",
					"openInNewTab": "false",
					"codeBlocks": [
						{
							"pretext": "<p>Each method of decomposition uses various basic fundamental matrix operations, as follows:</p><p>Printing out matrices in a way that can be easily read and accurately displayed in the terminal:</p><p>To be able to view the results of our matrix operations and display the contents of the matrices, we must be able to print matrices in a form that is easily readable:</p>",
							"src": "/code/math/matrix-operations/print2d.java"
						},
						{
							"pretext": "<p>We must also be able to do the same with 3D matrices (or arrays of matrices):</p>",
							"src": "/code/math/matrix-operations/print3d.java"
						},
						{
							"pretext": "<p>In order to calculated the <a href=\"http://en.wikipedia.org/wiki/Transpose\">transpose</a> of a matrix:</p>",
							"src": "/code/math/matrix-operations/transpose.java"
						},
						{
							"pretext": "<p>Matrix subtraction:</p>",
							"src": "/code/math/matrix-operations/subtract.java"
						},
						{
							"pretext": "<p>Scalar multiplication on to a matrix:</p>",
							"src": "/code/math/matrix-operations/scalar.java"
						},
						{
							"pretext": "<p>Print a vector stored in a 1-dimensional array:</p>",
							"src": "/code/math/matrix-operations/print-vector.java"
						},
						{
							"pretext": "<p>Print a vector stored in a 2-dimensional array:</p>",
							"src": "/code/math/matrix-operations/print-2d-vector.java"
						},
						{
							"pretext": "<p>Print a vector stored in a 2D array, transposed:</p>",
							"src": "/code/math/matrix-operations/print-vector-transposed.java"
						},
						{
							"pretext": "<p>Subtract vectors:</p>",
							"src": "/code/math/matrix-operations/subtract-vectors.java"
						},
						{
							"pretext": "<p>Calculate the <a href=\"http://en.wikipedia.org/wiki/Norm_(mathematics)\">norm</a> of a vector:</p>",
							"src": "/code/math/matrix-operations/norm-vector.java"
						},
						{
							"pretext": "<p>Multiply a matrix by its transpose, as required by many methods of decomposition:</p>",
							"src": "/code/math/matrix-operations/multiply-U-by-Ut.java"
						},
						{
							"pretext": "<p>And finally, calculate the infinite norm of a matrix:</p>",
							"src": "/code/math/matrix-operations/infinite-norm.java"
						}
					]
				}
			]
		}
	]
}